In [1]:
import pandas as pd 
melb_data = pd.read_csv('data/melb_data_ps.csv', sep=',')

In [7]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

In [12]:
pl = (countries_df['population'] * 1000000) / countries_df['square']
round(pl.mean(), 2)

84.93

In [2]:
import pandas as pd
nlo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv', sep = ',')

In [3]:
nlo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
nlo['Time'] = pd.to_datetime(nlo['Time'])
nlo.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [7]:
years = nlo['Time'].dt.year 
years.mode()

0    1999
Name: Time, dtype: int64

In [23]:
nlo['Time'].dt.date
nv_d = nlo[nlo['State'] == 'NV']['Time'].dt.date.diff().dt.days
nv_d

76          NaN
172      1678.0
565      2767.0
566         0.0
613       290.0
          ...
17447      22.0
17567      14.0
17617       6.0
17890      32.0
18104      33.0
Name: Time, Length: 284, dtype: float64

In [25]:
round(nv_d.mean())

69